#Подсчитайте средний возраст пользователей в таблице users.

CREATE DATABASE IF NOT EXISTS lesson5;
USE lesson5;
DROP TABLE IF EXISTS users;
CREATE TABLE users (
  id SERIAL PRIMARY KEY,
  name VARCHAR(255),
  birthday_at DATE,
  created_at DATETIME DEFAULT CURRENT_TIMESTAMP,
  updated_at DATETIME DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP
);
-- вставим данные, используя filldb.info
INSERT INTO users VALUES (1,'Prof. Van Dicki','2020-03-01','2016-03-14 08:52:57','2016-06-09 08:14:35'),(2,'Rodrigo Beahan I','1987-06-17','2020-06-26 09:18:32','2013-11-18 12:31:47'),(3,'Marilyne Von Jr.','1989-04-13','2011-09-01 05:47:36','2014-03-10 13:35:37'),(4,'Cordell Metz I','1990-08-08','2016-10-20 03:40:17','2016-02-01 05:55:14'),(5,'Zelma Langosh V','2010-09-13','2019-10-15 20:55:26','2019-09-26 11:13:25'),(6,'Mr. Irwin Swift DVM','2002-09-13','2015-05-16 21:07:41','2016-12-08 03:07:24'),(7,'Bruce Smitham','1990-05-27','2021-02-11 16:34:53','2014-08-03 12:13:53'),(8,'Miss America Becker','1998-02-16','2019-09-30 17:09:27','2016-09-21 15:35:17'),(9,'Keara Franecki','1990-10-29','2014-08-24 22:03:59','2016-04-25 22:20:21'),(10,'Dr. Marcellus Bode','2014-08-12','2014-07-28 12:47:00','2013-01-19 20:50:05'),(11,'Miles Dickens','1986-02-25','2019-06-19 22:12:01','2019-02-17 16:01:55'),(12,'Arlene Keebler','1974-04-26','2013-10-13 01:47:25','2013-04-07 02:28:50'),(13,'Mrs. Shyanne Wuckert','1982-02-15','2014-03-28 09:40:52','2019-06-13 21:01:47'),(14,'Bertha Daniel','2004-12-26','2014-10-30 16:45:14','2013-01-26 15:35:09'),(15,'Mr. Jamarcus Morar','1983-07-30','2015-07-25 17:23:12','2014-08-07 19:25:39'),(16,'Herta Hamill','1998-02-04','2011-03-29 00:40:14','2016-04-27 17:01:50'),(17,'Dr. Yolanda Deckow MD','2018-04-07','2017-08-06 04:46:46','2017-05-24 01:02:49'),(18,'Dexter Kuvalis','1975-08-12','2020-05-15 05:59:55','2020-05-21 11:49:11'),(19,'Jose Wisoky','1997-08-31','2020-02-20 04:32:33','2013-10-18 07:37:52'),(20,'Demarco Cruickshank V','1973-05-16','2011-05-07 20:12:32','2016-08-18 13:55:05');
-- посмотрим на заполненную таблицу
SELECT * FROM users;
-- вычислим средний возраст
SELECT avg(Timestampdiff(YEAR,birthday_at,Now())) FROM users;